Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/include/proc/p32mz2064das169.h
extern volatile __OFF073bits_t OFF073bits __asm__ ("OFF073") __attribute__((section("sfrs"), address(0xBF810664)));
#define OFF074 OFF074
extern volatile uint32_t   OFF074 __attribute__((section("sfrs"), address(0xBF810668)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF074bits_t;
extern volatile __OFF074bits_t OFF074bits __asm__ ("OFF074") __attribute__((section("sfrs"), address(0xBF810668)));
#define OFF075 OFF075
extern volatile uint32_t   OFF075 __attribute__((section("sfrs"), address(0xBF81066C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF075bits_t;
extern volatile __OFF075bits_t OFF075bits __asm__ ("OFF075") __attribute__((section("sfrs"), address(0xBF81066C)));
#define OFF076 OFF076
extern volatile uint32_t   OFF076 __attribute__((section("sfrs"), address(0xBF810670)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF076bits_t;
extern volatile __OFF076bits_t OFF076bits __asm__ ("OFF076") __attribute__((section("sfrs"), address(0xBF810670)));
#define OFF077 OFF077
extern volatile uint32_t   OFF077 __attribute__((section("sfrs"), address(0xBF810674)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF077bits_t;
extern volatile __OFF077bits_t OFF077bits __asm__ ("OFF077") __attribute__((section("sfrs"), address(0xBF810674)));
#define OFF078 OFF078
extern volatile uint32_t   OFF078 __attribute__((section("sfrs"), address(0xBF810678)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF078bits_t;
extern volatile __OFF078bits_t OFF078bits __asm__ ("OFF078") __attribute__((section("sfrs"), address(0xBF810678)));
#define OFF079 OFF079
extern volatile uint32_t   OFF079 __attribute__((section("sfrs"), address(0xBF81067C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF079bits_t;
extern volatile __OFF079bits_t OFF079bits __asm__ ("OFF079") __attribute__((section("sfrs"), address(0xBF81067C)));
#define OFF080 OFF080
extern volatile uint32_t   OFF080 __attribute__((section("sfrs"), address(0xBF810680)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF080bits_t;
extern volatile __OFF080bits_t OFF080bits __asm__ ("OFF080") __attribute__((section("sfrs"), address(0xBF810680)));
#define OFF081 OFF081
extern volatile uint32_t   OFF081 __attribute__((section("sfrs"), address(0xBF810684)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF081bits_t;
extern volatile __OFF081bits_t OFF081bits __asm__ ("OFF081") __attribute__((section("sfrs"), address(0xBF810684)));
#define OFF082 OFF082
extern volatile uint32_t   OFF082 __attribute__((section("sfrs"), address(0xBF810688)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF082bits_t;
extern volatile __OFF082bits_t OFF082bits __asm__ ("OFF082") __attribute__((section("sfrs"), address(0xBF810688)));
#define OFF083 OFF083
extern volatile uint32_t   OFF083 __attribute__((section("sfrs"), address(0xBF81068C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF083bits_t;
extern volatile __OFF083bits_t OFF083bits __asm__ ("OFF083") __attribute__((section("sfrs"), address(0xBF81068C)));
#define OFF084 OFF084
extern volatile uint32_t   OFF084 __attribute__((section("sfrs"), address(0xBF810690)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF084bits_t;
extern volatile __OFF084bits_t OFF084bits __asm__ ("OFF084") __attribute__((section("sfrs"), address(0xBF810690)));
#define OFF085 OFF085
extern volatile uint32_t   OFF085 __attribute__((section("sfrs"), address(0xBF810694)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF085bits_t;
extern volatile __OFF085bits_t OFF085bits __asm__ ("OFF085") __attribute__((section("sfrs"), address(0xBF810694)));
#define OFF086 OFF086
extern volatile uint32_t   OFF086 __attribute__((section("sfrs"), address(0xBF810698)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF086bits_t;
extern volatile __OFF086bits_t OFF086bits __asm__ ("OFF086") __attribute__((section("sfrs"), address(0xBF810698)));
#define OFF087 OFF087
extern volatile uint32_t   OFF087 __attribute__((section("sfrs"), address(0xBF81069C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF087bits_t;
extern volatile __OFF087bits_t OFF087bits __asm__ ("OFF087") __attribute__((section("sfrs"), address(0xBF81069C)));
#define OFF088 OFF088
extern volatile uint32_t   OFF088 __attribute__((section("sfrs"), address(0xBF8106A0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF088bits_t;
extern volatile __OFF088bits_t OFF088bits __asm__ ("OFF088") __attribute__((section("sfrs"), address(0xBF8106A0)));
#define OFF089 OFF089
extern volatile uint32_t   OFF089 __attribute__((section("sfrs"), address(0xBF8106A4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF089bits_t;
extern volatile __OFF089bits_t OFF089bits __asm__ ("OFF089") __attribute__((section("sfrs"), address(0xBF8106A4)));
#define OFF090 OFF090
extern volatile uint32_t   OFF090 __attribute__((section("sfrs"), address(0xBF8106A8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF090bits_t;
extern volatile __OFF090bits_t OFF090bits __asm__ ("OFF090") __attribute__((section("sfrs"), address(0xBF8106A8)));
#define OFF091 OFF091
extern volatile uint32_t   OFF091 __attribute__((section("sfrs"), address(0xBF8106AC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF091bits_t;
extern volatile __OFF091bits_t OFF091bits __asm__ ("OFF091") __attribute__((section("sfrs"), address(0xBF8106AC)));
#define OFF092 OFF092
extern volatile uint32_t   OFF092 __attribute__((section("sfrs"), address(0xBF8106B0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF092bits_t;
extern volatile __OFF092bits_t OFF092bits __asm__ ("OFF092") __attribute__((section("sfrs"), address(0xBF8106B0)));
#define OFF093 OFF093
extern volatile uint32_t   OFF093 __attribute__((section("sfrs"), address(0xBF8106B4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF093bits_t;
extern volatile __OFF093bits_t OFF093bits __asm__ ("OFF093") __attribute__((section("sfrs"), address(0xBF8106B4)));
#define OFF094 OFF094
extern volatile uint32_t   OFF094 __attribute__((section("sfrs"), address(0xBF8106B8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF094bits_t;
