Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/include/proc/p32mz2064das169.h
#define _CEPOLLCON_BDPPLCON_POSITION             0x00000000
#define _CEPOLLCON_BDPPLCON_MASK                 0x0000FFFF
#define _CEPOLLCON_BDPPLCON_LENGTH               0x00000010

#define _CEHDLEN_HDRLEN_POSITION                 0x00000000
#define _CEHDLEN_HDRLEN_MASK                     0x000000FF
#define _CEHDLEN_HDRLEN_LENGTH                   0x00000008

#define _CETRLLEN_TRLRLEN_POSITION               0x00000000
#define _CETRLLEN_TRLRLEN_MASK                   0x000000FF
#define _CETRLLEN_TRLRLEN_LENGTH                 0x00000008

#define _RNGVER_REVISION_POSITION                0x00000000
#define _RNGVER_REVISION_MASK                    0x0000007F
#define _RNGVER_REVISION_LENGTH                  0x00000007

#define _RNGVER_VERSION_POSITION                 0x00000007
#define _RNGVER_VERSION_MASK                     0x0000FF80
#define _RNGVER_VERSION_LENGTH                   0x00000009

#define _RNGVER_ID_POSITION                      0x00000010
#define _RNGVER_ID_MASK                          0xFFFF0000
#define _RNGVER_ID_LENGTH                        0x00000010

#define _RNGCON_PLEN_POSITION                    0x00000000
#define _RNGCON_PLEN_MASK                        0x000000FF
#define _RNGCON_PLEN_LENGTH                      0x00000008

#define _RNGCON_TRNGEN_POSITION                  0x00000008
#define _RNGCON_TRNGEN_MASK                      0x00000100
#define _RNGCON_TRNGEN_LENGTH                    0x00000001

#define _RNGCON_PRNGEN_POSITION                  0x00000009
#define _RNGCON_PRNGEN_MASK                      0x00000200
#define _RNGCON_PRNGEN_LENGTH                    0x00000001

#define _RNGCON_CONT_POSITION                    0x0000000A
#define _RNGCON_CONT_MASK                        0x00000400
#define _RNGCON_CONT_LENGTH                      0x00000001

#define _RNGCON_TRNGMODE_POSITION                0x0000000B
#define _RNGCON_TRNGMODE_MASK                    0x00000800
#define _RNGCON_TRNGMODE_LENGTH                  0x00000001

#define _RNGCON_LOAD_POSITION                    0x0000000C
#define _RNGCON_LOAD_MASK                        0x00001000
#define _RNGCON_LOAD_LENGTH                      0x00000001

#define _RNGPOLY1_POLY_POSITION                  0x00000000
#define _RNGPOLY1_POLY_MASK                      0xFFFFFFFF
#define _RNGPOLY1_POLY_LENGTH                    0x00000020

#define _RNGPOLY2_POLY_POSITION                  0x00000000
#define _RNGPOLY2_POLY_MASK                      0xFFFFFFFF
#define _RNGPOLY2_POLY_LENGTH                    0x00000020

#define _RNGNUMGEN1_RNG_POSITION                 0x00000000
#define _RNGNUMGEN1_RNG_MASK                     0xFFFFFFFF
#define _RNGNUMGEN1_RNG_LENGTH                   0x00000020

#define _RNGNUMGEN2_RNG_POSITION                 0x00000000
#define _RNGNUMGEN2_RNG_MASK                     0xFFFFFFFF
#define _RNGNUMGEN2_RNG_LENGTH                   0x00000020

#define _RNGSEED1_SEED_POSITION                  0x00000000
#define _RNGSEED1_SEED_MASK                      0xFFFFFFFF
#define _RNGSEED1_SEED_LENGTH                    0x00000020

#define _RNGSEED2_SEED_POSITION                  0x00000000
#define _RNGSEED2_SEED_MASK                      0xFFFFFFFF
#define _RNGSEED2_SEED_LENGTH                    0x00000020

#define _RNGCNT_RCNT_POSITION                    0x00000000
#define _RNGCNT_RCNT_MASK                        0x0000007F
#define _RNGCNT_RCNT_LENGTH                      0x00000007

#define _DDRTSEL_TSEL_POSITION                   0x00000000
#define _DDRTSEL_TSEL_MASK                       0x000000FF
#define _DDRTSEL_TSEL_LENGTH                     0x00000008

#define _DDRMINLIM_MINLIMIT_POSITION             0x00000000
#define _DDRMINLIM_MINLIMIT_MASK                 0x0000001F
#define _DDRMINLIM_MINLIMIT_LENGTH               0x00000005

#define _DDRRQPER_RQPER_POSITION                 0x00000000
#define _DDRRQPER_RQPER_MASK                     0x000000FF
#define _DDRRQPER_RQPER_LENGTH                   0x00000008

#define _DDRMINCMD_MINCMD_POSITION               0x00000000
#define _DDRMINCMD_MINCMD_MASK                   0x000000FF
#define _DDRMINCMD_MINCMD_LENGTH                 0x00000008

#define _DDRMEMCON_STINIT_POSITION               0x00000000
#define _DDRMEMCON_STINIT_MASK                   0x00000001
#define _DDRMEMCON_STINIT_LENGTH                 0x00000001

#define _DDRMEMCON_INITDN_POSITION               0x00000001
#define _DDRMEMCON_INITDN_MASK                   0x00000002
#define _DDRMEMCON_INITDN_LENGTH                 0x00000001

#define _DDRMEMCFG0_RWADDR_POSITION              0x00000000
#define _DDRMEMCFG0_RWADDR_MASK                  0x0000001F
#define _DDRMEMCFG0_RWADDR_LENGTH                0x00000005

#define _DDRMEMCFG0_BNKADDR_POSITION             0x00000008
#define _DDRMEMCFG0_BNKADDR_MASK                 0x00001F00
#define _DDRMEMCFG0_BNKADDR_LENGTH               0x00000005

#define _DDRMEMCFG0_CSADDR_POSITION              0x00000010
#define _DDRMEMCFG0_CSADDR_MASK                  0x001F0000
#define _DDRMEMCFG0_CSADDR_LENGTH                0x00000005

#define _DDRMEMCFG0_CLHADDR_POSITION             0x00000018
#define _DDRMEMCFG0_CLHADDR_MASK                 0x1F000000
#define _DDRMEMCFG0_CLHADDR_LENGTH               0x00000005

#define _DDRMEMCFG0_APCHRGEN_POSITION            0x0000001E
#define _DDRMEMCFG0_APCHRGEN_MASK                0x40000000
#define _DDRMEMCFG0_APCHRGEN_LENGTH              0x00000001

#define _DDRMEMCFG1_RWADDRMSK_POSITION           0x00000000
#define _DDRMEMCFG1_RWADDRMSK_MASK               0x00001FFF
#define _DDRMEMCFG1_RWADDRMSK_LENGTH             0x0000000D

#define _DDRMEMCFG2_CLADDRHMSK_POSITION          0x00000000
#define _DDRMEMCFG2_CLADDRHMSK_MASK              0x00001FFF
#define _DDRMEMCFG2_CLADDRHMSK_LENGTH            0x0000000D

#define _DDRMEMCFG3_CLADDRLMSK_POSITION          0x00000000
#define _DDRMEMCFG3_CLADDRLMSK_MASK              0x00001FFF
#define _DDRMEMCFG3_CLADDRLMSK_LENGTH            0x0000000D

#define _DDRMEMCFG4_BNKADDRMSK_POSITION          0x00000000
#define _DDRMEMCFG4_BNKADDRMSK_MASK              0x0000001F
#define _DDRMEMCFG4_BNKADDRMSK_LENGTH            0x00000005

#define _DDRMEMCFG4_CSADDRMSK_POSITION           0x00000008
#define _DDRMEMCFG4_CSADDRMSK_MASK               0x00001F00
#define _DDRMEMCFG4_CSADDRMSK_LENGTH             0x00000005

#define _DDRREFCFG_REFCNT_POSITION               0x00000000
#define _DDRREFCFG_REFCNT_MASK                   0x0000FFFF
#define _DDRREFCFG_REFCNT_LENGTH                 0x00000010

#define _DDRREFCFG_REFDLY_POSITION               0x00000010
#define _DDRREFCFG_REFDLY_MASK                   0x00FF0000
#define _DDRREFCFG_REFDLY_LENGTH                 0x00000008

#define _DDRREFCFG_MAXREFS_POSITION              0x00000018
#define _DDRREFCFG_MAXREFS_MASK                  0x07000000
#define _DDRREFCFG_MAXREFS_LENGTH                0x00000003

#define _DDRPWRCFG_APWRDNEN_POSITION             0x00000002
#define _DDRPWRCFG_APWRDNEN_MASK                 0x00000004
#define _DDRPWRCFG_APWRDNEN_LENGTH               0x00000001

#define _DDRPWRCFG_ASLFREFEN_POSITION            0x00000003
#define _DDRPWRCFG_ASLFREFEN_MASK                0x00000008
#define _DDRPWRCFG_ASLFREFEN_LENGTH              0x00000001

#define _DDRPWRCFG_PWRDNDLY_POSITION             0x00000004
#define _DDRPWRCFG_PWRDNDLY_MASK                 0x00000FF0
#define _DDRPWRCFG_PWRDNDLY_LENGTH               0x00000008

#define _DDRPWRCFG_SLFREFDLY_POSITION            0x0000000C
#define _DDRPWRCFG_SLFREFDLY_MASK                0x003FF000
#define _DDRPWRCFG_SLFREFDLY_LENGTH              0x0000000A

#define _DDRPWRCFG_PCHRGPWRDN_POSITION           0x00000016
#define _DDRPWRCFG_PCHRGPWRDN_MASK               0x00400000
#define _DDRPWRCFG_PCHRGPWRDN_LENGTH             0x00000001

